/************************************************************
************************************************************/
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

/************************************************************
************************************************************/
public class DispResolution : MonoBehaviour
{
	/****************************************
	****************************************/
	private string label = "";

	/****************************************
	****************************************/
	
	/******************************
	******************************/
    void Start()
    {
        
    }

	/******************************
	******************************/
    void Update()
    {
		/********************
		********************/
		label = Screen.currentResolution.ToString() + "/ (" + Screen.width + ", " + Screen.height + ")"; // macの解像度 @ macのRefeshRate Hz/ (appの解像度)
    }
	
	/****************************************
	■GUIのフォントサイズ変更など
		http://himascript.blog.fc2.com/blog-entry-6.html
	****************************************/
	void OnGUI()
	{
		/********************
		GUI.xxxは、OnGUIの中でのみtouch可.
		********************/
		GUI.skin.label.fontSize = 40;
		GUI.color = Color.white;
		
		GUI.Label(new Rect(15, 50, 700, 50), label);
	}
}
